Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/L07.tmx
Source language: en_us
Languages: zh_cn

source: Kalawar
zh_cn: 卡拉瓦

source: Who really killed Abdur, an Afghan goatherd-turned-informant?
zh_cn: 究竟是谁杀了阿卜杜勒（Abdur），一个阿富汗牧羊人转变成的线人？

source: Camp Kearney
zh_cn: 科尔尼（Kearney）军营

source: Paktika Province, Afghanistan
zh_cn: 阿富汗帕克提卡（Paktika）省

source: TESTIMONY OF A WATERMELON VENDOR
zh_cn: 卖西瓜小贩的证词

source: Hah- me?
zh_cn: 啊——我？

source: Hardly.
zh_cn: 很难受。

source: Abdur was a friend, an old one.
zh_cn: 阿卜杜勒是我朋友，老朋友了。

source: So it was not difficult to identify him.
zh_cn: 所以不难认出他。

source: I had only to see his sandals.
zh_cn: 我只看到他的凉鞋。

source: You see, they were not the regular Peshawari chappals, the kind you find at the cobbler shops in Sharan.
zh_cn: 你们看，它们不是平常的白沙瓦（Peshawari）印度凉鞋，就是在沙兰（Sharan）的鞋匠铺里随处可见的那种。

source: His sandals were American.
zh_cn: 他的凉鞋是美国的。

source: A gift from a soldier.
zh_cn: 一个士兵送的礼物。

source: Abdur should never have accepted them.
zh_cn: 阿卜杜勒真不该收下它们。

source: As soon as he appeared at the market in those sandals, the rumors started.
zh_cn: 他一穿着这凉鞋出现在市场上，谣言就传起来了。

source: They said Abdur was a collaborator.
zh_cn: 他们说阿卜杜勒通敌。

source: He was alerting the foreign soldiers to the movements of the Taliban fighters.
zh_cn: 他向外国兵通报塔利班战士的活动。

source: Some even believed, given his youthful training as a lashkar, that he was acting as some kind of double agent.
zh_cn: 有些人甚至认为，考虑到他年轻时曾受训做过勤务兵，他在干某种双面间谍的勾当。

source: What?
zh_cn: 什么？

source: Yeah, he'd been a mujahid- but so were most able-bodied men of our generation.
zh_cn: 是的，他曾经是圣战士——但是我们这一代里大部分强壮的男人都曾经是。

source: That was 25 years ago, anyway.
zh_cn: 不管怎么说，那是25年前了。

source: We were children.
zh_cn: 我们还是孩子。

source: For the past two decades he has been a livestock trader: sheep and goats.
zh_cn: 在过去二十年里，他一直是个牲畜商：绵羊和山羊。

source: A peaceful man, Abdur.
zh_cn: 一个和平的人，阿卜杜勒。

source: He hadn't shown up to a dinner I hosted the previous night.
zh_cn: 在前一个晚上我请的晚宴上他没来。

source: When he was not at market that morning I became concerned.
zh_cn: 那天早上他也不在市场上，这时我开始担心。

source: So I looked for him at Kalawar.
zh_cn: 所以我到卡拉瓦找他。

source: The exact location of Kalawar?
zh_cn: 卡拉瓦的具体位置？

source: Hard to say.
zh_cn: 很难说。

source: You go about 200 meters south from the middle point in the Galfez-Patanah Road, then follow the curving path behind Waz'r Khan's farm over the east-facing hill, turning left at each fork but the third.
zh_cn: 从噶尔弗兹-帕塔纳路中间向南走大概200米，然后沿着瓦兹尔汗（Waz’r Khan）的农田后面那条弯曲的路越过朝东的那座山，在每一个岔路口朝左拐，除了第三个。

source: Well, I don't know how else to explain it to you.
zh_cn: 哦，我不知道再怎么跟你们解释。

source: I knew he was dead when I entered the hut and saw the soles of his sandals.
zh_cn: 我进到小屋看到他凉鞋的鞋底时就知道他死了。

source: His jacket was compressed into a ball and soaked through with blood.
zh_cn: 他的夹克衫卷成一团，浸透了血。

source: There was a single wound, but it was in the middle of his chest.
zh_cn: 就一个伤口，但是却在他胸口中间。

source: His heart had exploded.
zh_cn: 他的心脏被打破了。

source: I can't help but wonder whether the sandals were responsible.
zh_cn: 我禁不住怀疑那双凉鞋是否就是事情的根源。

source: TESTIMONY OF WAZ'R KHAN, RICE FARMER
zh_cn: 稻农瓦兹尔汗的证词

source: Yes, I saw Abdur that morning.
zh_cn: 是的，那天早上我见过阿卜杜勒。

source: He was with his youngest wife.
zh_cn: 他和他最小的妻子在一起。

source: The daughter of a woodworker in Galfez.
zh_cn: 噶尔弗兹一个木匠的女儿。

source: No, I can't describe her.
zh_cn: 不，我没法形容她。

source: I've never seen her face.
zh_cn: 我没看到过她的脸。

source: Kalawar?
zh_cn: 卡拉瓦？

source: Literally it means "castle-gate."
zh_cn: 字面上是“城堡大门”的意思。

source: It is said that in Mohammed's time Kalawar guarded the entrance to a large castle, but there is no evidence of such a castle.
zh_cn: 据说在穆罕穆德时代卡拉瓦守卫着一座大城堡的入口，但是现在没有一点这样一座城堡的痕迹了。

source: Most likely the structure belonged to a rice farmer.
zh_cn: 那座建筑很可能是属于一个稻农。

source: The ceiling collapsed centuries ago.
zh_cn: 天花板几百年前就倒塌了。

source: The walls remain, though they are broken in many sections.
zh_cn: 墙还留着，虽然很多地方也断裂了。

source: It is not visible from the road, and one must enter through my property.
zh_cn: 从路上看不到，必须从我的田地上穿过才能进去。

source: I let Abdur use it.
zh_cn: 我让阿卜杜勒使用这个地方。

source: He took his women there.
zh_cn: 他带他的女人到那里。

source: When he wanted privacy, you understand.
zh_cn: 当他想要私人空间时，你们懂的。

source: Yesterday morning we exchanged the normal pleasantries.
zh_cn: 昨天早上我们互相说着平常的玩笑话。

source: Abdur appeared to be happy.
zh_cn: 阿卜杜勒看上去很高兴。

source: The woman, who sat rather stiffly on the back of his horse, did not speak.
zh_cn: 那个女人，有点僵硬地坐在他的马背上，没说话。

source: She was covered from head to foot in a pale blue burqa.
zh_cn: 她从头到脚裹在一件浅蓝色的罩袍里。

source: He helped her down and tied the horse in my barn.
zh_cn: 他帮她下来，把马拴在我的牲口棚里。

source: That was the last time I saw him.
zh_cn: 那是我最后一次看到他。

source: Abdur was a noble man, and a brave fighter.
zh_cn: 阿卜杜勒是个高尚的人，一个勇敢的战士。

source: It would have taken a coward to kill him while he was alone with his wife.
zh_cn: 在他和妻子单独在一起时杀死他的人可能是个胆小鬼。

source: I hope you find the devil who did this.
zh_cn: 我希望你们找到了干这件事的恶棍。

source: I suspect he is one of yours.
zh_cn: 我怀疑他是你们的人。

source: Why else would the all-powerful United States Defense Intelligence Agency care about the death of a poor Pashtun goat trader.
zh_cn: 要不然为什么无所不能的美国国防情报局要关心一个普什图（Pashtun）穷卖羊的死因。

source: TESTIMONY OF DIA AGENT No. 727
zh_cn: 美国国防情报局特工727号的证词

source: Look, you know it as well as I do: Mark hasn't been right.
zh_cn: 你们看，你们和我一样都知道：马克一直不对劲。

source: Just hasn't.
zh_cn: 是一直。

source: He grows out the hair and the beard and puts on a salwar kameez, rubs some dirt on his face, and all of a sudden he's a madman.
zh_cn: 他留了头发和胡子，穿一套沙丽克米兹（salwar kameez，长衫加灯笼裤，中南亚传统民族服装），脸上擦些泥土，突然间他成了一个疯子。

source: I mean, sure, he looks like a madman- we all do- but he's been behaving like one too.
zh_cn: 我的意思是，当然了，他看起来像是个疯子——我们大家都是——但他一直以来行为举止也像个疯子。

source: His Pashto is decent, but probably not as decent as he thinks it is.
zh_cn: 他的普什图语（Pashto）不错，但或许没他认为的那么好。

source: Of course that didn't stop him from leaving camp alone, in blatant disregard of code.
zh_cn: 当然这并不妨碍他单独离开军营，完全不顾法规。

source: He'd go to bars, pick up local women.
zh_cn: 他去酒吧，勾搭当地的女人。

source: Where he takes them I have no idea, but he's shown me the photos.
zh_cn: 我不清楚他带她们去哪里，但他给我看过照片。

source: It's like he has a death wish.
zh_cn: 好像他有求死的愿望。

source: Can you imagine what these fuckers would do if they found out Mark was running off with their women?
zh_cn: 要是他们发现马克与他们的女人跑了，你能想象这些傻瓜会做什么吗？

source: I saw him at mess that day at breakfast. 0700.
zh_cn: 那天早饭时，7点钟，我看到他一团糟。

source: Said he was going to run surveillance detail on the Galfez-Patanah Road, and that he might pick up a source.
zh_cn: 说他要到噶尔弗兹-帕塔纳路执行监控任务，还说他可能找到一个消息来源。

source: He had a crazy sparkle in his eye, but that wasn't anything unusual.
zh_cn: 他眼睛里闪着狂热的火花，但那不是什么不平常的事。

source: If Mark did kill this goatherd, then I don't want to know what he did with the young wife.
zh_cn: 如果马克真的杀了这个牧羊人，那我不想知道他对那个年轻的妻子做了什么。

source: You haven't found her yet, huh?
zh_cn: 你们还没找到她，呃？

source: That's probably for the best.
zh_cn: 那可能最好了。

source: CONFESSION OF MARK SANTO, DIA AGENT No. 679
zh_cn: 美国国防情报局特工679号马克·圣多（MARK SANTO）的供词

source: Of course I killed him.
zh_cn: 当然是我杀了他。

source: You think I'm going to lie about that?
zh_cn: 你们认为我打算对这事儿撒谎吗？

source: Look, you know me.
zh_cn: 看，你们知道我的。

source: I may have bent some directives in the past, but I'd never dishonor the agency, or my country.
zh_cn: 我过去可能违背了一些命令，但我从未玷辱这个机构，和我的祖国。

source: I killed him, I had no choice.
zh_cn: 我杀了他，我没有选择。

source: But I didn't touch the woman.
zh_cn: 但我没碰那个女人。

source: You can't pin that on me.
zh_cn: 这你们不能归到我头上。

source: You'll see for yourself, if you find her.
zh_cn: 你们自己会查明白的，如果你们找到她。

source: She'll back me up.
zh_cn: 她会证明我说的是事实。

source: Let me lay it out as clean as possible.
zh_cn: 让我尽可能说完全吧。

source: Command had asked me to gather background on this goatherd Abdur Wali. He had made noises about wanting to sell us information about the Taliban.
zh_cn: 司令部要我收集这个牧羊人阿卜杜勒·瓦里的背景资料。他曾宣扬想要卖给我们关于塔利班的消息。

source: The guy knows everybody.
zh_cn: 那家伙认识所有人。

source: Each morning he's in the bazaar with his filthy sheep, their flanks absolutely torn apart by sores.
zh_cn: 每天早上他都在市场上和他脏不拉叽的绵羊在一起，它们的腰窝完全被伤口撕开了。

source: Hard to imagine that anyone buys them.
zh_cn: 很难想象有人会买它们。

source: But this guy, this Wali, was well respected.
zh_cn: 但这个家伙，这个瓦里，很受尊敬。

source: He had been a prominent freedom fighter in the Soviet era.
zh_cn: 他在苏联时代曾是一名出色的自由战士。

source: So I decide to set up a meeting.
zh_cn: 所以我决定安排一次会面。

source: My source tells me that there's an ancient ruin where Wali likes to lurk.
zh_cn: 我的消息来源告诉我有一处瓦里喜欢潜藏的古老废墟。

source: All I have to do is pay off the rice farmer who owns the land.
zh_cn: 我所要做的就是贿赂持有那块土地的稻农。

source: I visit the farmer at 14:00.
zh_cn: 我在14点钟拜访了那个农夫。

source: He confirms that Wali is indeed on the property, along with his youngest wife, some illiterate carpenter's daughter.
zh_cn: 他证实瓦里确实在那个地方，和他最年轻的妻子在一起，她是某个不识字的木匠的女儿。

source: His horse is tied to a stake behind the farmer's hut.
zh_cn: 他的马拴在农夫小屋后面的树桩上。

source: Apparently Wali doesn't have much privacy at his camp, with his kids and other wives running around.
zh_cn: 显然瓦里在他的帐篷里没有多少私人空间，有孩子和其他妻子到处跑。

source: So they use this pile of bricks as a love shack.
zh_cn: 所以他们把这堆砖用作爱的小屋。

source: The setup could not be more ideal.
zh_cn: 这个安排再理想不过了。

source: I'm guaranteed to have him to myself.
zh_cn: 我得到保证可以单独见他。

source: When I get there they seem to have just finished.
zh_cn: 我到的时候他们好像刚刚结束。

source: Naturally they're stunned to see me.
zh_cn: 看到我他们自然很惊讶。

source: The girl is very young, by the way, no older than 16, but that might be generous- you've seen how fast women age here.
zh_cn: 那个女孩非常年轻，顺便说一下，不超过16岁，但这数字可能还是大了——你们看到了这里的女人老得多快。

source: Anyway, the girl is pretty much dressed at this point, but the burqa, this baggy turquoise number, is hanging on the wall.
zh_cn: 不管怎样，这个时候女孩已经差不多穿戴好了，只剩下那件罩袍，那件宽松的蓝绿色衣服，还挂在墙上。

source: She grabs it off the hook and huddles behind it.
zh_cn: 她从钩子上抓过那件衣服，蜷缩在后面。

source: The man is strangely silent.
zh_cn: 那个男人很奇怪地没出声。

source: He knows who I am.
zh_cn: 他知道我是谁。

source: He whispers to the girl, and her eyes get all big.
zh_cn: 他对女孩耳语，她的眼睛睁得老大。

source: I tell you, she looked like a child.
zh_cn: 我跟你们说，她看起来像个孩子。

source: He orders her to wait outside.
zh_cn: 他命令她在外面等。

source: That's the last I see of her.
zh_cn: 那是我最后看到她。

source: I explain that I want to talk to him about becoming an informant.
zh_cn: 我解释说我想跟他谈谈关于成为线人的事。

source: He nods, but he's clearly uncomfortable, shaky.
zh_cn: 他点头，但很明显他心神不宁、局促不安。

source: His eyes are darting behind me to the door.
zh_cn: 他的眼神飘向我身后的门。

source: I tell him that I need to ask a few preliminary questions.
zh_cn: 我告诉他我需要问几个基本的问题。

source: I go through the routine, the basic background corroboration techniques, keeping close to the blue book.
zh_cn: 我履行正常程序，基本的背景核实方法，严格遵照蓝皮书。

source: I say that if he is discovered to be associated with the Taliban, he will be arrested and tried as a terrorist by a military tribunal.
zh_cn: 我说如果他被发现与塔利班有勾结，他将被逮捕并被军事法庭审判为恐怖分子。

source: Wali keeps nodding like an imbecile, but he no longer appears to be listening.
zh_cn: 瓦里像个傻子一样一直点头，但他看起来好像没在听。

source: That's when I notice his sandals.
zh_cn: 就是那个时候我注意到了他的凉鞋。

source: They're Tevas, the kind you can get at any mall back home.
zh_cn: 是泰瓦（Teva，美国运动凉鞋品牌），回到家里可以在任何商店买到的那种。

source: The only way he could've gotten them was from an American soldier.
zh_cn: 他能得到这双鞋的唯一方法就是从一个美国兵那里得到。

source: A dead one.
zh_cn: 一个死的兵。

source: He sees me looking at his feet.
zh_cn: 他看到我看着他的脚。

source: Slowly he steps backwards, toward the corner, where his jacket is lying on the ground.
zh_cn: 他慢慢地向后退，退向墙角，他的夹克衫放在那里的地上。

source: He mumbles something about his cell phone, turns, and pulls up his jacket.
zh_cn: 他咕哝了几句关于他手机的什么话，转身拿起了他的夹克衫。

source: I reach for my switch but- here's the crazy thing- I don't fire.
zh_cn: 我伸手拿我的枪，但——疯狂的是——我没开枪。

source: All of my instincts told me that he was grabbing a gun, that he was going to fire at me, but I just stood there, hapless.
zh_cn: 我所有的本能告诉我他在拿着一把枪，他要朝我开枪，但倒霉的是，我只是站在那里。

source: I know I have a reputation for being a short fuse and all, but in that moment I was being careful.
zh_cn: 我知道我有脾气暴躁什么的名声，但在那一刻我是很谨慎的。

source: Too careful, really.
zh_cn: 太谨慎了，其实。

source: It should have cost me my life.
zh_cn: 差点要了我的命。

source: The jacket falls, and he's aiming a rusty old nine millimeter at my chest.
zh_cn: 夹克衫落下来，他拿着一把生锈的9毫米口径的老枪对准我的胸膛。

source: The gun is Soviet issue, probably 30 years old.
zh_cn: 那把枪是苏联产的，大概有30年了。

source: It's fluky.
zh_cn: 性能不稳。

source: He pulls.
zh_cn: 他开枪了。

source: The first shot goes into the ground.
zh_cn: 第一枪打到了地上。

source: The second whizzes over my head.
zh_cn: 第二枪嗖嗖地从我头上飞过。

source: Yeah, two rounds in total.
zh_cn: 是的，总共两枪。

source: By that time I'd come to my senses.
zh_cn: 到那时我回过神了。

source: I put a deadbolt into his heart.
zh_cn: 我将致命一的枪打进他的心脏。

source: I ran outside to find the girl, but, like I said, she was gone.
zh_cn: 我跑到外面去找那个女孩，但是，如我所说，她跑了。

source: I listened for the sound of her footsteps on the grass path but all I could hear was the goatherd's dying moans.
zh_cn: 我努力听她在长满草的路上的脚步声，但我听到的只有那个牧羊人垂死的呻吟声。

source: There's no visibility at the site- the path ascends from the ruin and after 20 yards it curls around a hill- so I ran up the incline to see if I could spot her.
zh_cn: 在那个地方什么都看不到——那条路从废墟那里向上20码后转过一座山——所以我跑上斜坡看看能否发现她。

source: It was too late.
zh_cn: 太晚了。

source: She'd disappeared into the dunes, along with Wali's horse.
zh_cn: 她已经消失在沙丘里，和瓦里的马一起。

source: I returned to camp and notified command.
zh_cn: 我返回军营，通知了司令部。

source: Everything had gone according to protocol until you boys ordered me in here and informed me that there was an investigation.
zh_cn: 一起都照章进行，直到各位命令我到这儿来，通知我有一项调查。

source: My only regret is that the girl got away.
zh_cn: 我唯一的遗憾是那个女孩逃跑了。

source: No, I don't think she's a threat.
zh_cn: 不，我不认为她是个威胁。

source: She's probably relieved to be done with the old lecher.
zh_cn: 她或许还从忍受那个老色鬼的痛苦中解放出来了。

source: I doubt she'll rattle.
zh_cn: 我认为她不会乱说话。

source: Even if she did talk- who would believe a word she said?
zh_cn: 即使她真的说了——谁会相信她说的？

source: CONFESSION OF THE WOODWORKER'S DAUGHTER IN HER FATHER'S TENT
zh_cn: 木匠的女儿在她父亲帐篷里的供词

source: Yes, I did it.
zh_cn: 是，我干的。

source: I did it!
zh_cn: 我干的！

source: I guess you will kill me now?
zh_cn: 我猜你们现在就要杀了我？

source: Very well.
zh_cn: 那好吧。

source: It doesn't seem that I have a choice.
zh_cn: 好像我也没得选。

source: You must think that I despised Abdur.
zh_cn: 你们一定认为我很讨厌阿卜杜勒。

source: But that's not true.
zh_cn: 但不对。

source: I loved him.
zh_cn: 我爱他。

source: He was strong, noble, brave, wise.
zh_cn: 他强壮、高尚、勇敢、聪明。

source: He was making a lot of money and wanted to take me away from Sharan.
zh_cn: 他在赚很多钱，想要带我离开沙兰。

source: Or so he told me.
zh_cn: 反正他是这么跟我说的。

source: The last thing he said?
zh_cn: 他最后说的话？

source: That he loved me.
zh_cn: 是他爱我。

source: Imagine that.
zh_cn: 想象一下。

source: Two seconds later the American soldier surprised us like a djinn springing from the sand.
zh_cn: 两秒钟后那个美国兵像个从沙子里跳出来的神怪把我们给惊呆了。

source: This soldier boy spoke terrible Pashto.
zh_cn: 这个小兵普什图语说得很糟。

source: He was like a rabid dog, with large, wild eyes and a screaming voice.
zh_cn: 他像一条疯狗，眼睛又大又野蛮，声音刺耳。

source: His hair was long and his beard ragged.
zh_cn: 他头发很长，胡子乱糟糟的。

source: He kept staring at me, gesturing at my body.
zh_cn: 他一直盯着我看，对我的身体打手势。

source: He wanted, he said, he wanted- to possess me.
zh_cn: 他想要，他说，他想要——占有我。

source: Just as Abdur had.
zh_cn: 就像阿卜杜勒做过的。

source: [sobbing]
zh_cn: [抽泣]

source: I'm sorry.
zh_cn: 对不起。

source: That is not the reason I'm crying.
zh_cn: 那不是我哭的原因。

source: Or not the main reason.
zh_cn: 或者说不是主要原因。

source: The terrible thing was that Abdur did not protest.
zh_cn: 可恶的是阿卜杜勒没有反抗。

source: Not for a single moment.
zh_cn: 一点儿都没有。

source: His face went dark, his eyes were dead in his head, and he agreed instantly to this maniac's request.
zh_cn: 他的脸色变黑了，他的眼睛在他脑袋上像死了一样，他立即答应了这个疯子的要求。

source: Bowing, like a slave, he stepped out of the ruin and waited silently while the American had his way.
zh_cn: 鞠躬，像个奴隶一样，他走出了废墟，在那个美国人为所欲为时静静地等。

source: I shrieked and called out in pain, begging Abdur, but he would not do anything.
zh_cn: 我大声喊叫，痛苦地喊叫，乞求阿卜杜勒，但他什么都不做。

source: I could see his sandals in the doorway from where I was lying.
zh_cn: 从我躺的地方我可以看到他在门口的凉鞋。

source: He was watching- just standing there and watching.
zh_cn: 他在看——只是站在那儿看。

source: I'll never forget the sight of his ugly, hairy feet in those sandals.
zh_cn: 我永远不会忘记他丑陋、毛茸茸的脚穿在那双凉鞋里的情景。

source: When the soldier boy was done with me, he went outside to talk to Abdur.
zh_cn: 那个小兵干完我后就出去跟阿卜杜勒说话。

source: As I rose to my feet, I saw, lying in the corner, Abdur's jacket.
zh_cn: 我站起来时，看到放在角落里的阿卜杜勒的夹克衫。

source: I reached inside and removed his gun.
zh_cn: 我伸手到里面拿出了他的枪。

source: When I turned around, Abdur had come back into the house.
zh_cn: 当我转身时，阿卜杜勒已经回到了房子里。

source: "It's okay," he said. "You were brave.
zh_cn: “好了，”他说，“你很勇敢。

source: This man will give us a lot of money- "
zh_cn: 这个人会给我们很多钱——”

source: I didn't let him finish.
zh_cn: 我没让他说完。

source: I started shooting.
zh_cn: 我开始射击。

source: I missed the first two times- I had never used a gun before- but on the third, Alhamdulillah, the bullet went straight into his heart.
zh_cn: 前两次没打中——我以前从没用过枪——但是第三次，赞美真主，子弹直接打进了他的心脏。
